["RT @tslajms: @elonmusk @Tesla Thank you so much for this life changing car. The wife an I flew to Vegas to pickup our #Model3 and drove it…", "RT @MattLevinson: Thank you @elonmusk and @tesla for by FAR the best consumer product I have ever used. Day one is a 6 hour road trip to ca…", "RT @tecnocato: TODAY our solar roof generated 68 kWh. My house consumption was 25.8 kWh giving us a surplus of 42 kWh of energy. That's eno…", "RT @elonmusk: @Virtualanom Not only needs to be botproof, but seek &amp; unmask anyone operating a disinformation bot army", "RT @elonmusk: @andyjayhawk Thought you’d say that. Anytime anyone criticizes the media, the media shrieks “You’re just like Trump!” Why do…", "RT @ElectrekCo: Tesla Model 3 sales beat BMW 3-Series and Mercedes C-Class during first quarter in California, says report https://t.co/k0r…", "RT @physorg_com: Two sportscar-sized satellites in orbit to measure Earth's water https://t.co/7qiqy4SEVD", "RT @SpaceX: More photos from today’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/K2QlUnwKcJ", "RT @jodigralnick: ICYMI: here’s another 5 minutes of @MorganLBrennan exclusive interview with @SpaceX president &amp; COO Gwynne Shotwell, talk…", "RT @jodigralnick: ALL DAY TOMORROW ON @CNBC: @MorganLBrennan has an exclusive look at @SpaceX, including a sitdown with President &amp; COO Gwy…", "RT @nova_road: Commercial Crew astronaut Suni Williams wearing a #SpaceX spacesuit while training with a mock-up of the Crew Dragon in Hawt…", "RT @Tesla: Model X is the first and only SUV to achieve a NHTSA 5-Star safety rating in every category and subcategory, with the lowest pro…", "RT @ElectrekCo: Tesla Model X breaks electric towing record by pulling a Qantas Boeing 787-9 Dreamliner https://t.co/Ss104vfbcF by @frederi…", "RT @Tesla: 140 Tesla Powerpacks now live in Belgium and balancing the European electrical grid 100 times faster than fossil fuel plants htt…", "RT @SpaceX: More photos from the first flight of Falcon 9 Block 5 → https://t.co/095WHWMtKp https://t.co/4gZsAc01Bg", "RT @SpaceX: Falcon 9 Block 5 first stage has landed on the Of Course I Still Love You droneship. https://t.co/YHqdxIrc8b", "RT @SpaceX: Successful deployment of Bangabandhu Satellite-1 to geostationary transfer orbit confirmed. https://t.co/aX7kRQtBpZ", "RT @thesheetztweetz: Look at the relief from @elonmusk on the @SpaceX livestream – you can tell how important this first #Block5 mission wa…", "RT @ElectrekCo: Tesla’s giant battery in Australia reduced grid service cost by 90% https://t.co/vzKgWm742S by @fredericlambert https://t.c…", "RT @SpaceX: Standing down today due to a standard ground system auto abort at T-1 min. Rocket and payload are in good health—teams are work…", "RT @SpaceX: Falcon 9 Block 5 and Bangabandhu Satellite-1 went vertical on Pad 39A in Florida this morning. Now targeting liftoff at 4:42 p.…", "RT @Tesla: Wild horses in winter at Gigafactory 1 https://t.co/bbGp9NwBbq", "RT @Tesla: 50 million Americans say their next vehicle will be electric\nhttps://t.co/z6rRoWKFzc", "RT @SpaceX: Targeting Falcon 9 Block 5 launch of Bangabandhu Satellite-1 on May 10 from Pad 39A in Florida."]