["RT @realDonaldTrump: Not surprisingly, the GREAT Men &amp; Women of the FBI are starting to speak out against Comey, McCabe and all of the poli…", "RT @Scavino45: Last week after visiting FLOTUS Melania, POTUS Trump went to visit wounded HEROES at Walter Reed Medical Center. He told the…", "RT @Scavino45: Today, President Trump issued an Executive Grant of Clemency (Full Pardon) posthumously to John Arthur “Jack” Johnson, the f…", "RT @Scavino45: cc: @POTUS @realDonaldTrump https://t.co/MasB5mdUVS", "RT @Scavino45: Today, @POTUS @realDonaldTrump welcomed 106-year-old Pearl Harbor veteran Ray Chavez of Poway, California to the @WhiteHouse…", "RT @EricTrump: It is emotional day being back at @StJude in celebration of our dear friend Colin! He was a beautiful child who we will all…", "RT @realDonaldTrump: We grieve for the terrible loss of life, and send our support and love to everyone affected by this horrible attack in…", "RT @SteveForbesCEO: .@realDonaldTrump speech on drug costs pays immediate dividends. New @Amgen drug lists at 30% less than expected. Middl…", "RT @WhiteHouse: #Laurel? #Yanny? Or... https://t.co/5hth07SdGY", "RT @Scavino45: “Job openings hit record high of 6.6 million” https://t.co/BwDsLU6T4l", "RT @Scavino45: “Trump is putting the US back on top” https://t.co/tnYo2EAd2T", "RT @WhiteHouse: \"Finally, I want to deliver a message to the long-suffering people of Iran. The people of America stand with you.\" https://…", "RT @WhiteHouse: \"At the heart of the Iran deal was a giant fiction: that a murderous regime desired only a peaceful nuclear energy program.…", "RT @WhiteHouse: \"So today, on behalf of the United States, I want to thank every Olympian and Paralympian... To every member of @TeamUSA, I…", "RT @WhiteHouse: \"Today I am honored to welcome Chancellor Angela Merkel back to the White House... We are also pleased to have our newly co…", "RT @realDonaldTrump: Democrats are obstructing good (hopefully great) people wanting to give up a big portion of their life to work for our…", "RT @mike_pence: PROUD to support our friend @VoteMarsha for US Senate representing Tennessee. Marsha Blackburn is a rock-ribbed conservativ…", "RT @dmartosko: The same can be said of the \"collusion\" stuff. https://t.co/xMCVuH3OTs"]