["RT @CLewandowski_: Looking forward to being on @foxandfriends tomorrow around 7:45 AM on @FoxNews. Hope you watch.", "RT @foxandfriends: 223,000 jobs added in May, even the NYT runs out of words to describe how good the numbers are! https://t.co/K1GB8G0zsf", "RT @JesseBWatters: The media had it's worst week ever! @charliekirk11 and @JoeConchaTV break it down on @WattersWorld https://t.co/uMEblnh6…", "RT @KimKardashian: I would like to thank President Trump for his time this afternoon. It is our hope that the President will grant clemency…", "RT @FoxNews: President @realDonaldTrump participates in the U.S. Coast Guard [@USCG] Change-of-Command Ceremony. https://t.co/ekWubVkf1h", "RT @SecPompeo: The proposed summit offers a historic opening for @POTUS and Chairman Kim to boldly lead U.S. and #DPRK into a new era of pe…", "RT @AP_Politics: Trump set to promote youth sports, wants such activities to be more accessible to economically disadvantaged children: htt…", "RT @dougmillsnyt: Children race as @realDonaldTrump looks on with @IvankaTrump and New York Yankees legend Mariano Rivera they as they part…", "RT @IvankaTrump: Today @POTUS hosted #FieldDay at the @WhiteHouse with the announced President’s Council on Sports, Fitness and Nutrition.…", "RT @HerschelWalker: What an awesome day in D.C. participating @WhiteHouse Sports &amp; Fitness Day with @IvankaTrump @POTUS @MistyMayTreanor @M…", "RT @Scavino45: President Trump kisses Jordan McLinn, who suffers from Duchenne Muscular Dystrophy (DMD), after signing the #RightToTry Act…", "RT @realDonaldTrump: Not surprisingly, the GREAT Men &amp; Women of the FBI are starting to speak out against Comey, McCabe and all of the poli…", "RT @Scavino45: Last week after visiting FLOTUS Melania, POTUS Trump went to visit wounded HEROES at Walter Reed Medical Center. He told the…", "RT @Scavino45: Today, President Trump issued an Executive Grant of Clemency (Full Pardon) posthumously to John Arthur “Jack” Johnson, the f…", "RT @Scavino45: cc: @POTUS @realDonaldTrump https://t.co/MasB5mdUVS", "RT @Scavino45: Today, @POTUS @realDonaldTrump welcomed 106-year-old Pearl Harbor veteran Ray Chavez of Poway, California to the @WhiteHouse…", "RT @EricTrump: It is emotional day being back at @StJude in celebration of our dear friend Colin! He was a beautiful child who we will all…", "RT @realDonaldTrump: We grieve for the terrible loss of life, and send our support and love to everyone affected by this horrible attack in…", "RT @SteveForbesCEO: .@realDonaldTrump speech on drug costs pays immediate dividends. New @Amgen drug lists at 30% less than expected. Middl…", "RT @WhiteHouse: #Laurel? #Yanny? Or... https://t.co/5hth07SdGY", "RT @Scavino45: “Job openings hit record high of 6.6 million” https://t.co/BwDsLU6T4l", "RT @Scavino45: “Trump is putting the US back on top” https://t.co/tnYo2EAd2T", "RT @WhiteHouse: \"Finally, I want to deliver a message to the long-suffering people of Iran. The people of America stand with you.\" https://…", "RT @WhiteHouse: \"At the heart of the Iran deal was a giant fiction: that a murderous regime desired only a peaceful nuclear energy program.…"]